/** Chapter5：介绍重构名录 */
//本书剩余的篇幅是一份重构的名录。最初这个名录只是我的个人笔记，我用它来提示自己如何以安全且高效的方式进行重构。

//5.1 重构的记录格式--------------------------------------------------------------------------------------------------------------------------------
//介绍重构时，我采用一种标准格式。每个重构手法都有如下 5 个部分。

//首先是名称（name）。要建造一个重构词汇表，名称是很重要的。这个名称也就是我将在本书其他地方使用的名称。
//如今重构经常会有多个名字，所以我会同时列出常见的别名。

//名称之后是一个简单的速写（sketch）。这部分可以帮助你更快找到你所需要的重构手法。

//动机（motivation）为你介绍“为什么需要做这个重构”和“什么情况下不该做这个重构”。

//做法（mechanics）简明扼要地一步一步介绍如何进行此重构。

//范例（examples）以一个十分简单的例子说明此重构手法如何运作。

//5.2 挑选重构的依据--------------------------------------------------------------------------------------------------------------------------------
// /这不是一份巨细靡遗的重构名录。我只是认为这些重构手法最值得被记录下来。
//之所以说它们“最值得”，因为这些都是很常用的重构手法，并且值得给它们命名和详细的介绍：
//其中一些做法很有意思，能帮助读者提高整体重构技能水平，另外一些则对于代码设计质量的提升效果显著。
